src/main/resources/xml/ukLocationSoap/getUKLocationByCounty/getUKLocationByCounty.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetUKLocationByCounty>
         <web:County>Devon</web:County>
      </web:GetUKLocationByCounty>
   </soapenv:Body>
</soapenv:Envelope>