src/main/resources/xml/UKLocation/getUKLocationByPostCode/getUKLocationByPostCode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetUKLocationByPostCode>
         <!--Optional:-->
         <web:PostCode>SO21</web:PostCode>
      </web:GetUKLocationByPostCode>
   </soapenv:Body>
</soapenv:Envelope>