src/main/resources/xml/UKLocation/getUKLocationByCounty/getUKLocationByCounty.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetUKLocationByCounty>
         <!--Optional:-->
         <web:County>Hampshire</web:County>
      </web:GetUKLocationByCounty>
   </soapenv:Body>
</soapenv:Envelope>